tutorials/modules/incompressibleVoF/damBreakPorousBaffle/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

fields true;

baffles
{
    cyclicFaces
    {
        type        searchableSurface;
        surface     searchablePlate;
        origin      (0.3042 0.0493 -100);
        span        (0 0.1584  200);

        owner
        {
            name        porous_half0;
            type        cyclic;
            neighbourPatch porous_half1;

            patchFields
            {
                p_rgh
                {
                    type        porousBafflePressure;
                    patchType   cyclic;
                    D           10;
                    I           5;
                    length      0.15;
                    jump        uniform 0;
                    value       uniform 0;
                }
            }
        }

        neighbour
        {
            name        porous_half1;
            type        cyclic;
            neighbourPatch porous_half0;

            patchFields
            {
                $../../owner/patchFields;
            }
        }
    }
}


// ************************************************************************* //
